In [6]:

import pandas as pd
import numpy as np
import pymysql

In [37]:
 #importing the library

#Connecting to MySQL database using pymysql
connection = pymysql.connect(host='localhost', #host name
                             user='root', #username
                             password='Assie@225', #password
                             database='SUPPLYCHAINDB') #database name

#Checking if the connection is established
if connection:
    print("Connection Successful!")

Connection Successful!

In [49]:
my_cursor = connection.cursor()

In [16]:
my_cursor.execute('SELECT *FROM phone')

20

In [17]:
for x in my_cursor:
    print(x)

(100, 'Iphone12', 'Iphone', 25000)
(101, 'Iphone 12 Pro', 'Iphone', 25000)
(102, 'vivo v20', 'Vivo', 27000)
(103, 'Samsung S17', 'Samsung', 56000)
(104, 'Oppo A12', 'Oppo', 29000)
(105, 'Airtel F1', 'Airtel', 28000)
(106, 'Nokia Q2', 'Nokia', 27000)
(107, 'Alcatel G4', 'Alcatel', 28000)
(108, 'Teckno P1', 'Teckno', 66000)
(109, 'Iphone 13', 'Iphone', 77000)
(110, 'Samsung S20', 'Samsung', 67000)
(1011, 'vivo v20', 'Vivo', 27000)
(1012, 'Samsung S17', 'Samsung', 56000)
(1013, 'Oppo A12', 'Oppo', 29000)
(1014, 'Airtel F1', 'Airtel', 28000)
(1015, 'Nokia Q2', 'Nokia', 27000)
(1016, 'Alcatel G4', 'Alcatel', 28000)
(1017, 'Teckno P1', 'Teckno', 66000)
(1018, 'Iphone 13', 'Iphone', 77000)
(119, 'Samsung S20', 'Samsung', 67000)

In [18]:
my_cursor.execute('SHOW DATABASES')

10

In [19]:
for x in my_cursor:
    print(x)

('Big_data',)
('Book_details',)
('SUPPLYCHAINDB',)
('database1',)
('employees',)
('information_schema',)
('mysql',)
('performance_schema',)
('shop_database',)
('sys',)

In [22]:
my_cursor.execute('USE SUPPLYCHAINDB')

0

In [40]:
my_cursor.execute('SELECT *FROM EMPLOYEE')

10

In [41]:
arr = []
for x in my_cursor:
    arr.append(x)

In [48]:
for x in arr:
    print(x)
    print('--'*24)

(123456, 'MADELEINE REYES', datetime.date(1979, 4, 1), '9020 BESSIE COLEMAN', 'NEW HAVEN', 'CONNECTICUT', '06556', datetime.date(2007, 1, 15), None)
------------------------------------------------
(123457, 'AMYA KINNEY', datetime.date(1981, 3, 16), 'PINE STREET', 'Cambridge', 'MA', '02214', datetime.date(2009, 9, 4), None)
------------------------------------------------
(123458, 'CATLYN PETERS', datetime.date(1991, 10, 13), '742 ORNAGO AVENUE', 'LEXINTON', 'MA', '02223', datetime.date(2011, 7, 2), None)
------------------------------------------------
(123459, 'MORIAH NASH', datetime.date(1992, 8, 25), 'SIMMONS STREET', 'WARREN', 'MICHIGAN', '48033', datetime.date(2015, 2, 5), None)
------------------------------------------------
(123460, 'PATRICK HANSEN', datetime.date(1985, 9, 25), '485 PEASANT STREET', 'COLORADO SPRINGS', 'SPRINGS', '80772', datetime.date(2010, 8, 5), None)
------------------------------------------------
(123461, 'SHANK BARTON', datetime.date(1982, 5, 14), '614 SHAWMUT AVENUE', 'BOSTON', 'MA', '02118', datetime.date(1998, 2, 14), datetime.date(2016, 5, 3))
------------------------------------------------
(123462, 'EMILY BRONK', datetime.date(1988, 7, 12), '1712 LOST RIVER RD.', 'NORTH WOODSTOCK', 'NH', '03262', datetime.date(2016, 4, 21), datetime.date(2019, 3, 31))
------------------------------------------------
(123463, 'ANDY DUFFERHEN', datetime.date(1976, 3, 31), '13 SAMUEL J ROAD', 'ALBUQUERQUE', 'NEW MEXICO', '87105', datetime.date(1995, 1, 11), datetime.date(2013, 3, 16))
------------------------------------------------
(123464, 'TIMMY CUFFMAN', datetime.date(1999, 6, 23), '851 HARRISON AVENUE', 'BOSTON', 'MA', '02118', datetime.date(2017, 12, 14), None)
------------------------------------------------
(123465, 'KATHY BLEAK', datetime.date(1992, 2, 27), '801 E WAYNE AVENUE', 'WOOSTER', 'OHIO', '44691', datetime.date(2012, 4, 30), None)
------------------------------------------------

In [50]:
my_cursor.execute('Desc EMPLOYEE')

9

In [51]:
for x in my_cursor:
    print(x)

('EMP_ID', 'int', 'NO', 'PRI', None, 'auto_increment')
('EMP_NAME', 'varchar(255)', 'NO', '', None, '')
('EMP_DOB', 'date', 'YES', '', None, '')
('EMP_STREET', 'varchar(255)', 'YES', '', None, '')
('EMP_CITY', 'varchar(255)', 'YES', '', None, '')
('EMP_STATE', 'varchar(255)', 'YES', '', None, '')
('EMP_ZIP', 'varchar(5)', 'YES', '', None, '')
('EMP_HIREDATE', 'date', 'YES', '', None, '')
('EMP_ENDDATE', 'date', 'YES', '', None, '')

In [52]:
data = pd.DataFrame(columns=['EMP_ID','EMP_NAME','EMP_DOB','EMP_STREET','EMP_CITY','EMP_STATE',\
                            'EMP_ZIP','EMP_HIREDATE','EMP_ENDDATE'],data=arr)

In [53]:
data

,EMP_ID,EMP_NAME,EMP_DOB,EMP_STREET,EMP_CITY,EMP_STATE,EMP_ZIP,EMP_HIREDATE,EMP_ENDDATE
0,123456,MADELEINE REYES,1979-04-01,9020 BESSIE COLEMAN,NEW HAVEN,CONNECTICUT,06556,2007-01-15,None
1,123457,AMYA KINNEY,1981-03-16,PINE STREET,Cambridge,MA,02214,2009-09-04,None
2,123458,CATLYN PETERS,1991-10-13,742 ORNAGO AVENUE,LEXINTON,MA,02223,2011-07-02,None
3,123459,MORIAH NASH,1992-08-25,SIMMONS STREET,WARREN,MICHIGAN,48033,2015-02-05,None
4,123460,PATRICK HANSEN,1985-09-25,485 PEASANT STREET,COLORADO SPRINGS,SPRINGS,80772,2010-08-05,None
5,123461,SHANK BARTON,1982-05-14,614 SHAWMUT AVENUE,BOSTON,MA,02118,1998-02-14,2016-05-03
6,123462,EMILY BRONK,1988-07-12,1712 LOST RIVER RD.,NORTH WOODSTOCK,NH,03262,2016-04-21,2019-03-31
7,123463,ANDY DUFFERHEN,1976-03-31,13 SAMUEL J ROAD,ALBUQUERQUE,NEW MEXICO,87105,1995-01-11,2013-03-16
8,123464,TIMMY CUFFMAN,1999-06-23,851 HARRISON AVENUE,BOSTON,MA,02118,2017-12-14,None
9,123465,KATHY BLEAK,1992-02-27,801 E WAYNE AVENUE,WOOSTER,OHIO,44691,2012-04-30,None